[
    {
        "id": 1,
        "title": "Portfolio Website",
        "year": "2024",
        "shortDescription": "A portfolio website made to showcase my work and skills. The project is a frontend-only project built with React and TailwindCSS to promote responsive design and dark mode styling. I chose for the website to be hosted on AWS Amplify to develop my skills in cloud computing",
        "madeAt": "Independent Project",
        "builtWith": ["React", "TailwindCSS", "AWS", "Vite", "JSON"],
        "thumbnail": "portfolio.png",
        "link": "https://nathanhutch.dev",
        "live": true,
        "featured": false
    },
    {
        "id": 2,
        "title": "Heart Rate Recovery Tracker",
        "year": "2024",
        "shortDescription": "My final year dissertation project, a smartwatch application built for tracking users Heart Rate Recovery (HRR) after exercise. The application was built using Kotlin as the main development language including device sensor API's, Jetpack Compose for the visual design, and the Room Database for data storage. The project was designed using Figma and the final application was evaluated on a physical smartwatch.",
        "madeAt": "University of Glasgow",
        "builtWith": ["Kotlin", "Jetpack Compose", "Android Studio", "Figma", "Android"],
        "thumbnail": "hrrtracker.png",
        "link": "https://youtu.be/IDYGxBrBPv8",
        "live": false,
        "featured": true
    },
    {
        "id": 3,
        "title": "Building Futures Galloway",
        "year": "2023",
        "shortDescription": "An independently built website for Building Futures Galloway, a small charity based in the south of Scotland. The website was built using WordPress as a Headless-CMS, with a Next.JS and TailwindCSS based frontend. The project makes use of several third-party API's such as Stripe, Facebook, Eventbrite and Google Maps",        
        "madeAt": "Remote Work",
        "builtWith": ["Next.JS", "WordPress", "TailwindCSS", "Figma", "JSON"], 
        "thumbnail": "bfghomepage.png",
        "link": "https://www.buildingfuturesgalloway.com",
        "live": true,
        "featured": true
    },
    {
        "id": 4,
        "title": "GuitarGuitar JSON Visualiser",
        "year": "2023",
        "shortDescription": "A coding challenge involving creatively displaying JSON data from GuitarGuitar's API in a 48 hour time frame. Completed as part of a small team of 5 individuals, we worked into the early morning to create a visually appealing and interactive website. The project was built using Next.JS and TailwindCSS, with TypeScript for type safety and JSON fetched in from the given API endpoint.",
        "madeAt": "Do You Have the GUTS Hackathon",
        "builtWith": ["Next.JS", "TypeScript", "TailwindCSS", "JSON"],
        "thumbnail": "guitarguitar.png",
        "link": "https://www.loom.com/share/94b81828ba8b428ba51a9c83922e1960?sid=7b53d9d5-40a5-4c08-850e-2dc01037502d",
        "live": false,
        "featured": true
    },
    {
        "id": 5,
        "title": "BrewDog Carbon Calculator",
        "year": "2023",
        "shortDescription": "A carbon calculator website made for businesses as part of BrewDog's 'Planet First Locals' initiative. The website was built as part of a team of 6, where my roles included frontend development, CI/CD and hosting. React was selected for the frontend as a new technology to everyone in the team at the time, with Django being used for the backend. The project wireframes were designed using Figma, helping us maintain an agile approach with our client throughout the development of the website.",
        "madeAt": "University of Glasgow",
        "builtWith": ["React", "Django", "Figma"],
        "thumbnail": "brewdog.png",
        "link": "https://github.com/NHutch2002/BrewdogProject",
        "live": true,
        "featured": false
    }
]