[
    {
        "quote":
            "Nathan did a great job of designing our first-ever website to exact specifications: this included easily updateable news and products, a shopping cart linked to customer payment options and live links to our social media. We were delighted with Nathan’s speed of response and his understanding of us as a charity client with unique goals and needs. He gave us a comprehensive handover and was always ready to answer questions, even after the website was up and running!",
        "name": "Julia Muir Watt",
        "title": "Building Futures Galloway"
    },
    {
        "quote":
            "I started teaching Nathan in the 2021-22 academic year, where he did great. Nathan got an excellent mark for his team project, showing he works well as part of a team. Nathan after his third year then worked for a charity in a summer placement, where he had an excellent performance. I have been Nathan's adviser of studies for his four years at the University of Glasgow and he has been a pleasure to work with.",
        "name": "Derek Sommerville",
        "title": "Adviser of Studies @ University of Glasgow"
    },
    {
        "quote": "I've collaborated with Nathan on numerous projects, and his performance has been consistently outstanding. He never fails to complete his tasks, often exceeding expectations by proposing and implementing innovative ideas. Nathan's reliability, creativity, and initiative make him an invaluable team member. His ability to consistently deliver results while bringing fresh perspectives to our work is remarkable. I wholeheartedly recommend Nathan for any position requiring a dependable, resourceful, and forward-thinking individual.",
        "name": "Turki Almutairi",
        "title": "Student @ University of Glasgow"
    },
    {
        "quote": "I was Nathan’s project supervisor for his final year dissertation project looking at Heart Rate Recovery for fitness tracking, where he did very good. Nathan showed excellent professional conduct throughout and arrived well-prepared for every meeting. He was always very keen to work on new challenges and ensured solid project management throughout. Nathan’s final project was of a high standard and he was able to present his work well.",
        "name": "Dr. Xianghua (Sharon) Ding",
        "title": "Dissertation Supervisor @ University of Glasgow"
    }
]