[
    {
        "id": 1,
        "company": "Building Futures Galloway",
        "link": "https://buildingfuturesgalloway.com",
        "role": "Independent Web Developer",
        "location": "Remote",
        "dates": "June 2023 - September 2023",
        "description": {
            "bullets": [
                "Developed a user-centric interface with a strong focus on enhancing user experience and ensuring responsive design.",
                "Proactively learned and utilised new technologies to enhance functionality and optimise performance.",
                "Provided clear and precise documentation of website workings, ensuring long-term maintainability.",
                "Maintained clear and effective client communication by conducting weekly progress meetings.",
                "Effectively managed time and priorities to meet project deadlines in a solo work environment.",
                "Developed thorough documentation, detailing the updating of the dynamic elements of the website."
            ]
        }
    },
    {
        "id": 2,
        "company": "Amazon EDI4",
        "link": "https://amazon.com",
        "role": "Warehouse Operative",
        "location": "Dunfermline, Scotland",
        "dates": "June 2021 - August 2021",
        "description": {
            "bullets": [
                "Worked intuitively in a busy environment to achieve business targets.",
                "Displayed a strong attention to detail with awareness that errors could impact on team performance.",
                "Flexible in taking on new responsibilities and shifts.",
                "Provided assistance to new team members.",
                "Self-motivated to work through long daily shifts."
            ]
        }
    },
    {
        "id": 3,
        "company": "Go Escape",
        "link": "https://goescape.uk/",
        "role": "Gamesmaster",
        "location": "Dunfermline, Scotland",
        "dates": "October 2021 - September 2021",
        "description": {
            "bullets": [
                "Worked within strict timescales to turnaround customers and reset rooms.",
                "Worked methodically and accurately when resetting clues and guiding customers through game.",
                "Ran multiple rooms at once, showing ability to multitask under pressure.",
                "Responsible for running the games without supervision.",
                "Welcoming customers, being approachable and ensuring they had fun."
            ]
        }
    }
]